tap "homebrew/bundle"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "lazygit"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "neovim", args: ["HEAD"]
brew "node"
brew "ripgrep"
brew "starship"
brew "vivid"
brew "wget"
brew "zellij"
brew "zoxide"
