tap "homebrew/bundle"
brew "bat"
brew "c-ares"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "lazygit"
brew "libnghttp2"
brew "z3"
brew "llvm"
brew "lsd"
brew "luajit"
brew "luarocks"
brew "msgpack"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "node"
brew "nushell"
brew "oh-my-posh"
brew "ripgrep"
brew "starship"
brew "util-linux"
brew "vivid"
brew "wget"
brew "zellij"
brew "zoxide"
