tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "olets/tap"
brew "fish"
brew "fzf"
brew "gh"
brew "go"
brew "lazygit"
brew "llvm"
brew "luarocks"
brew "neovim", args: ["HEAD"]
brew "node"
brew "pure"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-autopair"
brew "zsh-vi-mode"
brew "olets/tap/zsh-abbr"
